{"pages":[],"posts":[{"title":"Let's Talk: A Blog About Life Aspirations and Success (Part 2)","permalink":"http://deeplydiligent.github.io/blog/2018/07/14/Let-s-Talk-A-Blog-About-Life-Aspirations-and-Success-Part-2/","text":"Make It UpI was always interested in a variety of different cultures during my upbringing. It intrigued me that ideologies with conflicting beliefs could exist. Like how can there be two different ways of looking at the same truth. Anyway, during this time I learnt about one of the key lessons from the Buddha himself. “Life itself is a form of suffering” Yes. If you take someone and give them access to absolutely all desires from birth, will they become happy and contented that they are living in a state better than countless other people? Never! They will be ungreatful, they would like to explore other less than perfect worlds. So if the happiness is actually in the climb instead, simply asking for the right things and struggling for them, makes you happy. Okay I want a cushy job, good wife, travel a lot and … HOLD IT!That answer is so general that there are countless people saying the same thing. Yet its mostly objective and self centric. We need to establish a few rules: Your purpose needs to be something that: Helps others. You can never achieve. That way, not only do you feel good because you are constantly providing value to the community, you also are on this constant trendmill to struggle to reach an unreachable goal. Hence UNLIMITED HAPPINESS. Except Not ReallyHave you ever had that feeling when you do something hard for a long time and it becomes mundane and monotonous, like high school algebra or your first job? That’s what is bound to happen here too. Stay tuned for tomorrow’s post to find out how to avoid monotonity in your daily endeavours. Until then, continue working. Think of goals which match the criteria above. I wish you all the best!"},{"title":"Let's Talk: A Blog About Life Aspirations and Success","permalink":"http://deeplydiligent.github.io/blog/2018/07/13/Let-s-Talk-A-Blog-About-Life-Aspirations-and-Success/","text":"At the beginning there was nothing. Life didn’t even exist. We were created through years of evolution, centuries of change, millenia of catastrophies and era’s of knowledge and turmoil. Yet one of the most mind boggling questions that we always ask is… Why Do I Exist?Look i’ll be honest I have no clue. Noone has any clue. Even when youre in heaven. Even when you’re farting fairy dust in your fancy Ferrari and three story mansion. You’ll still have no clue what you’re doing. Why Try?I’m glad you asked. You see, many people make up their own mind about this after reading that theres no magic point to life. They realise that the dream house, the cushy job, the fancy wife are not all they are made up to be. So they quit. These are the so called “mid life crisis” points of our lives. We don’t know what we worked so hard to build. We suffer from the “hedonic tredmill” of always jumping on the next supposed high. Get this, eat that, try this, experience that. Its like a never ending cycle of misery. How can we get a purpose? We will be answering this question, along with how to set proper goals in tommorrow’s post. Stay tuned!"},{"title":"Welcome to the DeeplyDiligent Blog!","permalink":"http://deeplydiligent.github.io/blog/2018/07/13/hello-world/","text":"Welcome to my personal blog! Here I post about my countless endeavours in programming, personal finance and lifelong learning. Since, this is my first post and this blog was made using Hexo, I reckon it’s the perfect time to do a Hexo Tutorial! But before that, why did I decide to start a blog? Lets do a quick AskDeeplyDiligent! Oh Another Blog! Why?1234while (human.exists())&#123; learn(); teach();&#125; I always have two central philosophies at the center of all my activities: Attain knowledge from a variety of sources. This has taken me everywhere from the darkest corners of Youtube, to School, and more recently, University. The desire to learn and be curious about esoteric topics from finance to human relations drives my intuition. It also means that I accept many different viewpoints and base my philosophy by taking feedback from each. Share this knowledge using all means possible, so that I can empower people of all ages to be able to do work they never could before. It is this aspect of leadership that drives me, since it is only by working together that we can multiply our knowledge and output, pushing the world forward Ah Cool! So like every other startup founder ever?Maybe. Except the posts will be much shorter (I promise)! Getting Started on HexoSince this is my output for the day, lets talk about Hexo! From my personal experience, Hexo was the easiest way to deploy a GitHub Pages Blog. Why? Lets find out Need 3 Things NodeJS GIT Computer Wizardary Okay maybe not the last one 😂! Install Hexo1npm install -g hexo-cli Create Project123$ hexo init new_project_name$ cd folder$ npm install Changing your _config.ymlAfter you open the project in your favourite code editor (yay Visual Studio Code :D), you will need to modify the _config.yml file to choose a theme! Yess themes! I want mooaarrr!Yes, hexo has plenty of themes to choose from! You can find them at the themes page on the hexo website. Create a new postLets get down to business. Writing a new post: 1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to github pages1$ npm install hexo-deployer-git --save Then edit your _config.yml file’s deploy options. Here are mine for your reference:1234deploy: type: git repo: https://github.com/DeeplyDiligent/blog branch: master Remember to update the URL section as well:12url: http://deeplydiligent.github.io/blogroot: /blog/ That’s It! Finally, whenever you’re ready for launch:12$ hexo clean$ hexo deploy More info: Deployment ConclusionI wish you all the best with your learning, creating, dealing, adjusting and financing activities, whatever you do in your daily life. I’ll endeavour to post on a daily basis (no guarantees 😉) about my usual activities and what I learnt from that day. Thanks a lot for reading my first post and I’ll be writing to you all again very shortly, so stay tuned 😁!"}]}