{"pages":[],"posts":[{"title":"Staring at Our Phones","permalink":"http://deeplydiligent.github.io/blog/2018/07/30/Staring-at-Our-Phones/","text":"We all do it. Day or Night. School or Work. We are constantly staring at a screen. In this series, I want to explore the consequences of this widespread phenomenon. I would also like to know how to best communicate in a thumb tapping world. So, how long do you spend staring at your phone? The Like SwitchIn his book, The Like Switch, Jack Schawfer explores the concept of phones and human communication. In a lecture, he instructs students to communicate face to face about any topic that interests them. The students are unable to utter anything meaningful. It takes a lot of both verbal and non-verbal communication to establish a strong connection and they simply lacked the skills to do this. Then came the phones. The students were asked to text each other instead of talking. Out came the funny, weird and charismatic personality hidden behind a wall of face to face communication. Why does this happen? We will explore this question and more in the next blog post."},{"title":"Fighting for Completion (Part 2)","permalink":"http://deeplydiligent.github.io/blog/2018/07/26/Fighting-for-Completion-Part-2/","text":"Hey everyone, having just returned from a vacation, guess how I felt going straight back to University? Lethargic, Demotivated and Pessimistic. I really thought, for the past few days, that the last year has been the best year, and I can’t do any better this time around. Then I turned around and questioned myself. Why Keep Climbing?Although I have posted a lot about the “single steps” that you can take in your journey of a thousand miles, I realise that I have somewhat ignored the reasons for undertaking the journey in the first place. So, I am going to give you three reasons why pushing will be beneficial for you. You Want HappinessIt is only by pushing yourself to do better that you will become happier. This is the reason why many retired individuals seek new experiences. It is the years of struggle which will strike you as the most insightful and pleasant. Embrace this. Your Contribution to the WorldWhen you feel like you’re making an impact, you will be really compelled to do more. But what about when you feel you are a burden on the world, getting educated and fear you will not be able to give back as much? Well it is in times like these when we should remind ourselves about the valuable contribution that we will make once we have the knowledge and skills to do so. Without skills we may be able to reach a hundred. But with these skills, the number is multiplied due to greater reputation and we are able to help a lot more. Just Get Started on a Small TaskWhen I came back, I knew that to get back to my old flow state, it wouldn’t be enough to remind myself of why I must take the first step. I also needed a clear first step to take. Getting started on the first task gives you the first rung on the ladder with which you can see the rest of the landscape clearer. Every step you take, it becomes easier to see the bigger picture. So, are you stuck in a peak, wondering how to proceed like me? Send me a message!"},{"title":"Fighting for Completion","permalink":"http://deeplydiligent.github.io/blog/2018/07/25/Fighting-for-Completion/","text":"When I was much younger and struggled to get my homework done on its due date, I would become terrified. We know that every single task is like a small mountain that we need to climb and that theres a drop at the end where the grass will be a lot greener. Conquering Mount EverestI’m sure you have a task with a high importance, a task that will make a crucial impact on your life, that is currently too big for you to do. Two possible issues are that you may have many different smaller tasks which are more urgent (have a closer due date) or you have no clue where to start the big task. This is your Mount Everest. Lets take you through conquering it Getting to the bottomBefore we can start climbing we must push all other tasks aside, leaving just the mountain itself. This is through prioritisation. Grab a pencil and start batching all the smaller tasks, then complete them one after another with minimal time wasted. Any tasks that you can defer, do it! Starting the climbWhether you cant think of somewhere to begin, or cant muster the motivation to put pen to paper, I guarantee that if you: Think of a tiny part of the task (read the assignment, write the first paragraph etc) Allocate a set time that you think will be enough for it You will find the task at least partially interesting and doable. That initial hump is the biggest. A rule in physics is that a system is much easier to keep going than it is to restart. I believe this principle applies nicely here as well. All the best! Next post, we will discuss what to do at the summit to prepare yourself best for the next task"},{"title":"The Journey of a Million Miles Starts With a Single Step (Part 4)","permalink":"http://deeplydiligent.github.io/blog/2018/07/24/The-Journey-of-a-Million-Miles-Starts-With-a-Single-Step-Part-4/","text":"Here is a way to measure yourself against Performance Metrics: A simple timetable. Out of simple things, big things growI once had a lemon plant. It didn’t grow very much in the Australian winter. Eventually it’s leaves started falling off and it was barely surviving. That summer, I was forced to do a little bit of research on plantation. I learnt how to care for lemon trees in Australia and how they can grow up with just a little care, effort, and most importantly…fertiliser! This is why Kaizen is so important. Keeping a very simple timetable will allow you to measure yourself against something quantifiable. It was also very easy to make on paper, so it would be hard to skip something that quick. Why it’s importantImagine you’re like me, trying to grow a lemon tree. Unless you measured the effect of each thing you tried: watering it, using different types of fertiliser, how would you know which one is working and which is not. It’s crucial to have a metric, since without it, the whole endeavour can go awfully awry."},{"title":"The Journey of a Million Miles Starts With a Single Step (Part 3)","permalink":"http://deeplydiligent.github.io/blog/2018/07/23/The-Journey-of-a-Million-Miles-Starts-With-a-Single-Step-Part-3/","text":"In the previous post I described a quick process that you can use to set yourself on a successful path. In this post, I would like to dive into why this works. Spaceship AnalogyEver seen a spaceship launch? I know that the glamour and amazement of watching the controlled explosion of metric tonnes of fuel leaves me excited and bewildered. Let me ask you this though: How much time do you reckon a spaceship bound for the mood spends on course? 90%? 80%? Nope nope. Throughout the whole process of taking off, going into orbit, passing the point where the moon’s gravity overtakes the earth and landing on the moon, the spaceship is on couse only 10% of time time. That’s right! The Importance of Course CorrectionYour life is quite like a spaceship. We must self correct along the way. But doing so requires something else really crucial, a way to measure our success against performance metrics."},{"title":"The Journey of a Million Miles Starts With a Single Step (Part 2)","permalink":"http://deeplydiligent.github.io/blog/2018/07/23/The-Journey-of-a-Million-Miles-Starts-With-a-Single-Step-Part-2/","text":"So, we’ve learnt what an average life looks like so lets… Spice it uppp 🔥🔥🔥I want you to start with a big change in your life. I’m going to call this an ‘innovation’. Its pretty simple really, pick one of these: waking up early, changing to a healthy diet, sticking to a study schedule or regular exercise. I’m going to assume very few people do all these already. If you are one of them, I’m sure you already have your own goals to use. Now, Kiazen dictates that we must make a small change. Big changes are scary. Small changes are the ones which compel us to climb the ladder one step at a time. Some small changes that I would suggest are: Make an alarm for a time to go to bed (try to make waking up early natural) Add one vegetable a day Every time you fail, ask yourself what went wrong Try doing just 10 pushups at a certain time every day See how I didnt instantly suggest the Keto diet, or joining a gym. That comes later. The momentum before those moves, however, is essential."},{"title":"The Journey of a Million Miles Starts With a Single Step","permalink":"http://deeplydiligent.github.io/blog/2018/07/22/The-Journey-of-a-Million-Miles-Starts-With-a-Single-Step/","text":"Lately I have been getting incredibly into researching a unique and valuable priciple known as Kaizen. Over the next few blogposts, I wish to take you through what Kaizen is, and how to apply it in your own life. A Brief Intro to Most People’s lifeAlright here we are, average. We go through 12 years of schooling, learning the bare minimum to get by. We hate learning, but know that we have to do it to get into a field that we can tolerate for the next 40 years. We confuse education and schooling, thinking that they are one and the same. We go get a bachaelors degree in a non-STEM field, hoping that the degree will be enough for us to get into a job. We try to focus and study but end up drunk at our best mate’s sister’s 21st Birthday Party. We mostly enjoy college, taking a bit of time off during exam time to cram some last minute revision, resenting every bit of it. During exams, we struggle to die down our nerves and due to a lack of proper exam technique, get mediocre results. Getting into jobs seems very difficult and so we settle. We settle for small companies paying mediocre wages. And we settle for a lackluster life of fullfilling family, management and social expectations. Now I completely understand everyone who has a medical and other circumstance and I am in no way suggesting everyone is like this. However, in my life experience, this is pretty much stock standard Average. Ill be looking into improvements that we could make on this in tomorrow’s post!"},{"title":"Productivity Tools (Part 3)","permalink":"http://deeplydiligent.github.io/blog/2018/07/20/Productivity-Tools-Part-3/","text":"I’m sure you’ve learn about the techniques that I use to prioritise tasks, but, you’re probably more curious about the tools that I use to achieve productive feats. I’ll however, have to answer that question with another question… What do you currently use?Its more than likely that what you use currently has the basic functionality already baked in to do what I described in yesterday’s post. Yet, we are constantly looking for new tools because we think that the tool can be a method to innovate drastic change into our daily schedule. Remember, Kaizen warns us against doing such drastic changes and discusses focusing on short term incremental goals, which would be much more achievable. Enough mate, I just want to do exactly what you do!…and thats the problem.It’s not enough to do exactly what I do to achieve astounding results, you must also embody the mindset and philosophy of an over-achiever. However, since some people will still ask for it, here is a brief snapshot of my Systems TrelloTrello has so far been my best “to-do list” type tracker. I have organised my trello on a weekly basis where I put in what needs to be done for which subject. I use trello for both individual and group projects Google CalendarCalendars are useful only for what they got made for, Time Management! Measure how much time you spent on each task and never lose track of the future tasks. Please do not turn your calendar into a todo list, since there could be many other ways you could categorise tasks other than its due date! Google DriveThis is your go to all-in-one, unlimited free usb storage that you cant lose again! Trust me, so much hassle saved when trying to plug the usb into the presentation computer, only to turn out that it was in a different usb. I hope that helped! Next up is a blog about travel, since this is what i’ve been up to lately :D"},{"title":"Productivity Tools (Part 2)","permalink":"http://deeplydiligent.github.io/blog/2018/07/20/Productivity-Tools-Part-2/","text":"You might be thinking to yourself right now, all these concentration development tactics are great and all, but how do I actually put them into practice? As a student, this question has also been a focus of mine, so let me take a few moments to highlight my strategy (as suggested by Cal Newport) and the reason for each step. You will see lots of the strategies that Cal discusses, as well as some improvements that I have made. The Student SamuraiSoon, you too could be knocking tasks out like your favourite cartoon character. Let me show you exactly how: First, we need to know what we need to do, and by when. Use your favourite to do list, be it digital or paper and pen, to do this. We then need to condense this information into a calendar, so you can plan to do certain tasks in certain sections of the day Finally, make sure trivial tasks such as taking the trash out, minor cleaning and planning meetups are clumped together and done in one part of the day. This way we can focus and get these done as fast as we can. ReasonThe reason that we create a huge todo list first is to give our brain the freedom to list out all its desires. Then, by prioritising this onto a calendar we are setting a clear goal for ourselves which we will strive to achieve. This is much better than, say, just checking things off as you do them. Finally, clumping minor tasks together allows Deep Work to take place, so that we can truely focus on the main tasks in the main parts of the day. PitfallsSome major problems with this method are that predicting timing of each task can be a challenge. I normally address this with a technique called Kaizen, which definitely deserves its own blogpost. However, in short, Kaizen is the practice of repeatedly enforcing small positive changes based on the outcome from a previous decision, which in this case would be whether you went under or over time, and you would base future predictions on that task accordingly. There’s a lot more to Kaizen, and I really suggest reading “One Small Step Can Change Your Life” to find out more about this technique."},{"title":"Using Digital Productivity Tools Effectively","permalink":"http://deeplydiligent.github.io/blog/2018/07/18/Productivity-Tools/","text":"I realise that normally my blogs are quite general adressing key issues in our lives, but recently, I have realised a disconnect between the time management tools everybody uses, and the outcomes that we wish to achieve in our flexible lives where we are forced to adopt to circumstances which no-one could have guessed, on a daily basis. 3 Quick Ways to reclaim your timeIn his book “Deep Work”, Cal Newport discusses the importance of focus to achieve the task at hand. He discusses that companies, rather than embodying deep work principles, are now discouraging it with new open offices and Instant Messaging. He argues that the only way to achieve great insights is to put our distractions aside and concentrate for long stretches of time. Whether or not you agree with his principles, we can all agree that a rejection of some alternatives here would lower our stress and increase productivity. Here are some of my techniques for doing just that: Reduce Stimulus: How many times in the last hour has your phone vibrated due to some notification? Turning my phone onto constant Do Not Disturb mode (not even vibrations) has significantly increased my focus. I no longer get distracted by IM notifications. Remember to whitelist apps such as your calendar which help you keep track of time. Set a goal to work Monday to Friday 9 to 5: Recall that when we discussed motivation, we set up small actions and committed to doing just those? It’s tough, I get it. Been there done that. Something is always delayed and takes up the whole weekend. But this is just one of the “do something” actions that you can adopt that will create further inspiration for yourself. Work ‘in a flow state’: Most people work ‘busy and anxious’. This is because they are constantly reacting to stimulus. When you are in a flow state, you will be indifferent to stimulus, since you will be constantly achieving your targets. I hope these 3 quick time savers have been useful for you. Next, we will take a look at schedules for students and what I personally use. All the best!"},{"title":"Getting Stuff Done (Part 2)","permalink":"http://deeplydiligent.github.io/blog/2018/07/17/Getting-Stuff-Done-Part-2/","text":"If you recall, in the last post we discussed disappointment panda and how it would be a crucial asset to us if we could… Be our own disappointment panda Prerequisites: Bamboo Loads of space An endangered species costume Jokes aside, its cruicial to cut the daily junk food diet of consumerism that attacks us. This is important for focus because it’s these that generally get us distracted from what we actually care about. Have you ever: Impulse bought items you didnt actually need from e-commerce sites? Compulsively checked your phone when you should be working, studying or working out?There are definitely actions within your reach which you can take. You most likely already know the steps you need to take to cure your bad habit. Then why don’t we all do it? We Lack MotivationIts another wednesday afternoon. You’ve just come home from work and its 6pm in the evening. You look at your todo list and there in big bold letters it says “Start a video for a new Youtube channel.” Sound familiar? I’m going to tell you how to defeat this lack of motivation today. But before that. Not long ago, there was an aspiring author who, much like me, was interested in writing his own book. He set his vision and had the credentials he needed but could never get started on the right foot. He wrote paragraphs but they just didn’t look perfect. He could never seem to get it right unitil… Two crappy pages per dayThat was the advice that allowed Tim Ferris to publish multiple bestsellers, including “The Four Hour Work Week.” The reason why we think a lack of motivation occurs is because we normally do not get started until we get inspired and motivated to do so. However, motivation actually works like so: Many of us (including me) often make the mistake of starting at the inspiration. Instead, action is the element that is always within reach and when that is your only measure of success then, well, even failure pushes us forward. Hope you guys got a lot out of it. Stay Tuned for next week’s post on productivity tools and how to best use them!"},{"title":"Getting Stuff Done","permalink":"http://deeplydiligent.github.io/blog/2018/07/17/Getting-Stuff-Done/","text":"Posts like this have, and will likely continue to be in very high demand. Why? The Urge to ProcrastinateIt has become a common figure in our ever distrated modern world. Procrastination can take many forms, but before we get to that… Disappointment PandaIn his bestsellers which I highly recommend for everyone reading my blog since it gives a basic philosophy of life, author Mark Manson invents a creature called “Disappointment Panda”. Now he argues that this creature could be the one that nobody wants but everybody needs. He would be like the grease stain on an otherwise clear glass window. He would break our day by uttering phrases that nobody likes hearing but we all need to pay attention to. He would be the cure for our constant pleasure driven, consumption controlled life. Oh its the doorbell! Disappointment Panda just arrived. “Life is essentially just a series of problems, Deep” he says. I ask him to elaborate. “I see you just bought a new car. Now that takes care of the embarassment you felt owning a beater, but it leaves you with high maintainence fees, a high interest loan to pay and financial stress in your family”. And with that, he puts his hat back on his head and goes trotting off into the sunset, never to be seen again, leaving me wondering where he came from in the first place. How does this have anything to do with procrastination?Ever had that feeling where you wait for the motivation to come from elsewhere to get started on a task. Yesterday was one such day for me. I did everything except what I planned to get done! The morning was spent reading stories online and the afternoon and evening was spent catching up with friends and family. I needed disappointment panda to let me know what needed doing. I needed him to remind me that uni was going to open soon. But he was nowhere to be found. Coming up tomorrow, we will discuss how to make your own disappointment panda. Until then: Here’s a link to Mark’s blog for you to browse at your leisure! I recommend starting with his post on procrastination."},{"title":"Let's Talk: Setting Values (Finale!)","permalink":"http://deeplydiligent.github.io/blog/2018/07/16/Let-s-Talk-Setting-Values-Finale/","text":"Why have proper values?Imagine you are a young backpacker and are given a list of 5 countries to choose to go to, with the pros and cons of each countries listed. You will feel excited that you have freedom to travel to any one of them and will pick the most desirable one. Now say you have 30 countries to pick from. Studies show that the more choices you have, the less satisfied you will be with the choice you make. You may feel like Thailand would have been a better choice that Switzerland since the weather would have been tropical, even though you prefer mountains. Values are like a siv, only thoughts and goals which align with your values are able to fit through the filter, allowing you to gain much higher levels of satisfaction. What are my values?You will be the best judge of what your values are. Below are some examples of good and bad values. Good Values (You have control over): Internal Peace Honesty Respecting others Learning Spending time with your close friends and family Bad Values (You have no control over): Never be alone Always be happy Be popular Earn lots of money Be with many partners Auto-suggestionThis is a technique which has been crucial for me in my value setting journey. Below are the brief steps to using this everyday: Set a goal or value which you would like to attain. Make sure you do it one at a time. Use a board or sheet of paper to write this goal so you read it every time you wake up. Every time you do the relevant activity, have the goal in the back of your mind so you practice it. Repeat the goal to yourself 3 or 4 time at least every day By simply following this strategy for many years, regardless of the difficulty of the goal, you will find it attainable. And thats it for today folks! Make sure to tune in next time for a regular update on my daily life. See you there!"},{"title":"Let's Talk: Avoiding Monotonity","permalink":"http://deeplydiligent.github.io/blog/2018/07/16/Let-s-Talk-Avoiding-Monotonity/","text":"It happens to the best of us. Be it your favourite food, movie, game, job or hobby, we all get bored at some point. Why? Let Me Tell You a StoryMy parents are really hard working middle-class people. Day in day out they spend their time diligently climbing their ways up the corporate ladder, trying to get the biggest slice of the pie with the least amount of work. However, when doing this, they are exceptionally bored with their daily lives. They look for holidays and weekends as an escape from their otherwise dull workplaces. Why It Never WorksEver watched a horse on a race track? It was fast wasn’t it? Now let’s say you’re in the era where no cars existed. You’re a horse taxi service which takes riders from location A to B in the least amount of time possible, the smaller the time, the more happy riders, and the more money you can potentially earn. What will you try to do to boost your profits? Recruit the fastest horses you can possibly get of course! You might even try to genetically engineer horses to make them faster and stronger. I hope you can see why this strategy never works. The corporate ladder is engineered for long days and sleepless nights. It is carved so that its deciples are unable to see the bigger picture. Tread Your Own PathHow I avoid monotonity in the workplace: Your values are the most crucial tool to solving the riddle of life. The priority that you give to each value will, over the long term, determine where you end up. Having good values is like learning the steps for solving a rubics cube. Just like there’s an incredibly minute chance that someone who has just picked up a properly scrambled rubics cube for the first time in their life will be able to solve it, there is also very little chance that that someone with inconsistent or vague values will be able to navigate life. Values must be prioritised, and we must ensure we are true to our values using a tactic I will introdouce next time called auto suggestion, first published in Napoleon Hill’s book “Think and Grow Rich”. More about that tomorrow. As Always…"},{"title":"Let's Talk: A Blog About Life Aspirations and Success (Part 2)","permalink":"http://deeplydiligent.github.io/blog/2018/07/14/Let-s-Talk-A-Blog-About-Life-Aspirations-and-Success-Part-2/","text":"Make It UpI was always interested in a variety of different cultures during my upbringing. It intrigued me that ideologies with conflicting beliefs could exist. Like how can there be two different ways of looking at the same truth. Anyway, during this time I learnt about one of the key lessons from the Buddha himself. “Life itself is a form of suffering” Yes. If you take someone and give them access to absolutely all desires from birth, will they become happy and contented that they are living in a state better than countless other people? Never! They will be ungreatful, they would like to explore other less than perfect worlds. So if the happiness is actually in the climb instead, simply asking for the right things and struggling for them, makes you happy. Okay I want a cushy job, good wife, travel a lot and … HOLD IT!That answer is so general that there are countless people saying the same thing. Yet its mostly objective and self centric. We need to establish a few rules: Your purpose needs to be something that: Helps others. You can never achieve. That way, not only do you feel good because you are constantly providing value to the community, you also are on this constant trendmill to struggle to reach an unreachable goal. Hence UNLIMITED HAPPINESS. Except Not ReallyHave you ever had that feeling when you do something hard for a long time and it becomes mundane and monotonous, like high school algebra or your first job? That’s what is bound to happen here too. Stay tuned for tomorrow’s post to find out how to avoid monotonity in your daily endeavours. Until then, continue working. Think of goals which match the criteria above. I wish you all the best!"},{"title":"Welcome to the DeeplyDiligent Blog!","permalink":"http://deeplydiligent.github.io/blog/2018/07/13/hello-world/","text":"Welcome to my personal blog! Here I post about my countless endeavours in programming, personal finance and lifelong learning. Since, this is my first post and this blog was made using Hexo, I reckon it’s the perfect time to do a Hexo Tutorial! But before that, why did I decide to start a blog? Lets do a quick AskDeeplyDiligent! Oh Another Blog! Why?1234while (human.exists())&#123; learn(); teach();&#125; I always have two central philosophies at the center of all my activities: Attain knowledge from a variety of sources. This has taken me everywhere from the darkest corners of Youtube, to School, and more recently, University. The desire to learn and be curious about esoteric topics from finance to human relations drives my intuition. It also means that I accept many different viewpoints and base my philosophy by taking feedback from each. Share this knowledge using all means possible, so that I can empower people of all ages to be able to do work they never could before. It is this aspect of leadership that drives me, since it is only by working together that we can multiply our knowledge and output, pushing the world forward Ah Cool! So like every other startup founder ever?Maybe. Except the posts will be much shorter (I promise)! Getting Started on HexoSince this is my output for the day, lets talk about Hexo! From my personal experience, Hexo was the easiest way to deploy a GitHub Pages Blog. Why? Lets find out Need 3 Things NodeJS GIT Computer Wizardary Okay maybe not the last one 😂! Install Hexo1npm install -g hexo-cli Create Project123$ hexo init new_project_name$ cd folder$ npm install Changing your _config.ymlAfter you open the project in your favourite code editor (yay Visual Studio Code :D), you will need to modify the _config.yml file to choose a theme! Yess themes! I want mooaarrr!Yes, hexo has plenty of themes to choose from! You can find them at the themes page on the hexo website. Create a new postLets get down to business. Writing a new post: 1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to github pages1$ npm install hexo-deployer-git --save Then edit your _config.yml file’s deploy options. Here are mine for your reference:1234deploy: type: git repo: https://github.com/DeeplyDiligent/blog branch: master Remember to update the URL section as well:12url: http://deeplydiligent.github.io/blogroot: /blog/ That’s It! Finally, whenever you’re ready for launch:12$ hexo clean$ hexo deploy More info: Deployment ConclusionI wish you all the best with your learning, creating, dealing, adjusting and financing activities, whatever you do in your daily life. I’ll endeavour to post on a daily basis (no guarantees 😉) about my usual activities and what I learnt from that day. Thanks a lot for reading my first post and I’ll be writing to you all again very shortly, so stay tuned 😁!"},{"title":"Let's Talk: A Blog About Life Aspirations and Success","permalink":"http://deeplydiligent.github.io/blog/2018/07/13/Let-s-Talk-A-Blog-About-Life-Aspirations-and-Success/","text":"At the beginning there was nothing. Life didn’t even exist. We were created through years of evolution, centuries of change, millenia of catastrophies and era’s of knowledge and turmoil. Yet one of the most mind boggling questions that we always ask is… Why Do I Exist?Look i’ll be honest I have no clue. Noone has any clue. Even when youre in heaven. Even when you’re farting fairy dust in your fancy Ferrari and three story mansion. You’ll still have no clue what you’re doing. Why Try?I’m glad you asked. You see, many people make up their own mind about this after reading that theres no magic point to life. They realise that the dream house, the cushy job, the fancy wife are not all they are made up to be. So they quit. These are the so called “mid life crisis” points of our lives. We don’t know what we worked so hard to build. We suffer from the “hedonic tredmill” of always jumping on the next supposed high. Get this, eat that, try this, experience that. Its like a never ending cycle of misery. How can we get a purpose? We will be answering this question, along with how to set proper goals in tommorrow’s post. Stay tuned!"}]}